<?php

for ($i=0;$i<11;$i+=2){ 
  echo $i."<br>";
}

/*
for迴圈有三個重要的宣告動作
初始動作: 第一次時會執行
進入條件: 每次判斷T/F要進入{}區域
離開動作: 結束後執行的指令
*/
print "<hr/>";
/* 練習1:如何用for印出以下畫面
1
4
7
10
*/
for($i=1;$i<=10;$i+=3){ //到這位置的i有1.4.7.10.13,撞5次
  echo $i."<br>"; //執行4次
}
print "<hr/>";

/* 
練習2:
1. 產生★*51顆橫向排列，每個★顏色不同彼此漸變。
2. 第一個★的色碼為rgb(0,0,255)，最後一個★的色碼為rgb(255,0,0)

<span style="color:rgb(255, 0, 0)">★</span>
*/
//////////////////////////////////////////////////////////////ver1
$r=0; //初始化
$b=255; //初始化
for($i=0;$i<51;$i++){
  echo '<span style="color:rgb('.$r.', 0, '.$b.')">★</span>';
  $r+=5;
  $b-=5;
}
print "<br>";
//////////////////////////////////////////////////////////ver2
for($i=0,$r=0,$b=255;$i<51;$i++,$r+=5,$b-=5){
  echo '<span style="color:rgb('.$r.', 0, '.$b.')">★</span>';
}

print "<br>";
//////////////////////////////////////////////////////////ver3
for($i=0;$i<255;$i+=5){
  echo '<span style="color:rgb('.$i.', 0, '.(255-$i).')">★</span>';
}
print "<hr>";
// 雙for迴圈

for($i=1;$i<5;$i++){ //跑4趟
  for($j=1;$j<5;$j++){ //單趟下跑4次
    echo $i."×".$j."=".($i*$j)."<br>";
  }
}
/*
$i=1;
for($j=1;$j<5;$j++){ //單趟下跑4次
  echo "i=".$i.",j=".$j."<br>";
}
$i=2;
for($j=1;$j<5;$j++){ //單趟下跑4次
  echo "i=".$i.",j=".$j."<br>";
}
$i=3;
for($j=1;$j<5;$j++){ //單趟下跑4次
  echo "i=".$i.",j=".$j."<br>";
}
$i=4;
for($j=1;$j<5;$j++){ //單趟下跑4次
  echo "i=".$i.",j=".$j."<br>";
}
*/
print "<hr/>";
?>